Repository: ahmedkamal22/Meals
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Pick your category
ar: اختر فئتك

source: Categories
ar: جميع الفئات

source: Favourites
ar: المفضلة

# notInFavourites
source: There isn't favourite meals yet
ar: لا توجد وجبات مفضلة حتى الآن

source: Cooking Up!
ar: الطهي!

source: Meals
ar: وجبات

source: Filters
ar: مرشحات

source: Settings
ar: الإعدادات

source: Italian
ar: إيطالي

source: Quick & Easy
ar: سريع وسهل

source: Hamburgers
ar: هامبرجر

source: German
ar: ألماني

source: Light & Lovely
ar: خفيف وجميل

source: Exotic
ar: غريب

source: Breakfast
ar: إفطار

source: Asian
ar: آسيوي

source: French
ar: فرنسي

source: Summer Luxurious
ar: فاخر صيفي

# Empty_meal
source: There isn't meals of these types
ar: لا توجد وجبات من هذا النوع

source: Spaghetti with Tomato Sauce
ar: سباغيتي بصلصة الطماطم

source: Toast Hawaii
ar: توست هاواي

source: Classic Hamburger
ar: هامبرجر كلاسيكي

source: Wiener Schnitzel
ar: شطيرة فينر

source: Salad with Smoked Salmon
ar: سلطة بالسلمون المدخن

source: Delicious Orange Mousse
ar: موس البرتقال اللذيذ

source: Pancakes
ar: فطائر

source: Creamy Indian Chicken Curry
ar: كاري دجاج هندي كريمي

source: Chocolate Souffle
ar: سوفليه الشوكولاتة

source: Asparagus Salad with Cherry Tomatoes
ar: سلطة الهليون مع الطماطم الكرزية

source: Change Mode
ar: تغيير الوضع

# Swap_Themes
source: Swap between b&w themes .
ar: التبديل بين السمات بالأبيض والأسود.

# Added_To_Favourites
source: Added To Favourites Successfully
ar: تمت الإضافة إلي المفضلة بنجاح

# Removed_From_Favourites
source: Removed From Favourites Successfully
ar: تمت الإزالة من المفضلة بنجاح

source: Ingredients
ar: المكونات

source: Steps
ar: الخطوات

source: Meals Filters
ar: مرشحات الوجبات

source: Gluten-free
ar: خالٍ من الغلوتين

source: Only include gluten-free meals.
ar: تضمين الوجبات الخالية من الغلوتين فقط.

source: Lactose-free
ar: خالٍ من اللاكتوز

source: Only include lactose-free meals.
ar: تضمين الوجبات الخالية من اللاكتوز فقط.

source: Vegetarian-free
ar: خالٍ من النباتية

source: Only include vegetarian-free meals.
ar: تضمين الوجبات الخالية من النباتية فقط.

source: Vegan-free
ar: خالٍ من النباتية الصرفة

source: Only include vegan-free meals.
ar: تضمين الوجبات الخالية من النباتية الصرفة فقط.

source: min
ar: دقيقة

source: Simple
ar: بسيط

source: Challenging
ar: تحدي

source: Hard
ar: صعب

source: Affordable
ar: ميسور

source: Pricey
ar: مكلف

source: Luxurious
ar: فاخر

# Four_Tomatoes
source: 4 Tomatoes
ar: 4 طماطم

# One_Tablespoon_of_Olive_Oil
source: 1 Tablespoon of Olive Oil
ar: 1 ملعقة كبيرة من زيت الزيتون

# One_Onion
source: 1 Onion
ar: 1 بصل

# Two_Hundred_Half_Spaghetti
source: 250g Spaghetti
ar: 250 جرام من السباغيتي

source: Spices
ar: بهارات

source: Cheese (optional)
ar: جبن (اختياري)

source: Cut the tomatoes and the onion into small pieces.
ar: قطع الطماطم والبصل إلى قطع صغيرة.

source: Boil some water - add salt to it once it boils.
ar: اغلي بعض الماء - أضف الملح إليه بمجرد أن يغلي.

source: Put the spaghetti into the boiling water - they should be done in about 10 to 12 minutes.
ar: ضع السباغيتي في الماء المغلي - يجب أن يتم ذلك في حوالي 10 إلى 12 دقيقة.

source: In the meantime, heated up some olive oil and add the cut onion.
ar: في هذه الأثناء، سخن بعض زيت الزيتون وأضف البصل المقطع.

# After_Two_minutes_add_the_tomato_pieces_salt_pepper_and_your_other_spices
source: After 2 minutes, add the tomato pieces, salt, pepper and your other spices.
ar: بعد دقيقتين، أضف قطع الطماطم والملح والفلفل والتوابل الأخرى.

source: The sauce will be done once the spaghetti are.
ar: ستكون الصلصة جاهزة بمجرد أن تنضج السباغيتي.

source: Feel free to add some cheese on top of the finished dish.
ar: يمكنك إضافة بعض الجبن على الطبق النهائي.

# One_Slice_White_Bread
source: 1 Slice White Bread
ar: 1 شريحة خبز أبيض

# One_Slice_Ham
source: 1 Slice Ham
ar: 1 شريحة لحم خنزير

# One_Slice_Pineapple
source: 1 Slice Pineapple
ar: 1 شريحة أناناس

# One_Two_Slices_of_Cheese
source: 1-2 Slices of Cheese
ar: 1-2 شرائح جبن

# Butter
source: 3 Tablespoons Butter, melted
ar: زبدة

source: Butter one side of the white bread
ar: ادهن جانبًا واحدًا من الخبز الأبيض بالزبدة

source: Layer ham, the pineapple and cheese on the white bread
ar: ضع طبقة من لحم الخنزير والأناناس والجبن على الخبز الأبيض

# Bake_the_toast_for_round_about_Ten_minutes_in_the_oven_at_Two_Hundred_Temp
source: Bake the toast for round about 10 minutes in the oven at 200°C
ar: اخبز التوست لمدة حوالي 10 دقائق في الفرن عند 200 درجة مئوية

# Three_Hundred_Gram_Cattle_Hack
source: 300g Cattle Hack
ar: 300 جرام لحم مفروم

# One_Tomato
source: 1 Tomato
ar: 1 طماطم

# One_Cucumber
source: 1 Cucumber
ar: 1 خيار

source: Ketchup
ar: كاتشب

# Two_Burger_Buns
source: 2 Burger Buns
ar: 2 خبز برجر

# Form_Two_patties
source: Form 2 patties
ar: شكل قطعتين برجر

# Fry_the_patties_for_c_Four_minutes_on_each_side
source: Fry the patties for c. 4 minutes on each side
ar: اقلي قطع البرجر لمدة حوالي 4 دقائق على كل جانب

# Quickly_fry_the_buns_for_c_One_minute_on_each_side
source: Quickly fry the buns for c. 1 minute on each side
ar: اقلي خبز البرجر بسرعة لمدة حوالي 1 دقيقة على كل جانب

source: Brush buns with ketchup
ar: ادهن الخبز بالكاتشب

source: Serve burger with tomato, cucumber and onion
ar: قدم البرجر مع الطماطم والخيار والبصل

# Eight_Veal_Cutlets
source: 8 Veal Cutlets
ar: 8 قطع لحم عجل

# Four_Eggs
source: 4 Eggs
ar: 4 بيضات

# Two_Hundred_Gram_Bread_Crumbs
source: 200g Bread Crumbs
ar: 200 جرام من فتات الخبز

# Hundred_Gram_Flour
source: 100g Flour
ar: 100 جرام من الدقيق

# Three_Hundred_ML_Butter
source: 300ml Butter
ar: 300 مل من الزبدة

# Hundred_Gram_Vegetable_Oil
source: 100g Vegetable Oil
ar: 100 جرام من الزيت النباتي

# Salt
source: 1 Teaspoon Salt
ar: ملح

source: Lemon Slices
ar: شرائح ليمون

# Tenderize_the_veal_to_about_Two_Four_MM_and_salt_on_both_sides
source: Tenderize the veal to about 2–4mm, and salt on both sides.
ar: طرّق لحم العجل حتى يصل سمكه إلى 2-4 ملم، وضع الملح على الجانبين.

source: On a flat plate, stir the eggs briefly with a fork.
ar: على طبق مسطح، حرك البيض لفترة وجيزة باستخدام شوكة.

source: Lightly coat the cutlets in flour then dip into the egg, and finally, coat in breadcrumbs.
ar: غلف قطع اللحم بالدقيق بخفة ثم اغمسها في البيض وأخيرًا غلفها بفتات الخبز.

source: Heat the butter and oil in a large pan (allow the fat to get very hot) and fry the schnitzels until golden brown on both sides.
ar: سخن الزبدة والزيت في مقلاة كبيرة (اجعل الدهن ساخنًا جدًا) واقلي الشنيتزل حتى يصبح لونه بنيًا ذهبيًا على الجانبين.

source: Make sure to toss the pan regularly so that the schnitzels are surrounded by oil and the crumbing becomes ‘fluffy’.
ar: تأكد من تقليب المقلاة بانتظام بحيث تحاط قطع الشنيتزل بالزيت ويصبح التغليف هشًا.

source: Remove, and drain on kitchen paper. Fry the parsley in the remaining oil and drain.
ar: أزلها وصفيها على ورق المطبخ. اقلي البقدونس في الزيت المتبقي وصفيه.

source: Place the schnitzels on warmed plate and serve garnished with parsley and slices of lemon.
ar: ضع قطع الشنيتزل على طبق دافئ وقدمها مزينة بالبقدونس وشرائح الليمون.

source: Arugula
ar: جرجير

source: Lamb's Lettuce
ar: خس الحمل

source: Parsley
ar: بقدونس

source: Fennel
ar: شمر

# Two_Hundred_Gram_Smoked_Salmon
source: 200g Smoked Salmon
ar: 200 جرام سمك سلمون مدخن

source: Mustard
ar: خردل

source: Balsamic Vinegar
ar: خل بلسمي

source: Olive Oil
ar: زيت زيتون

source: Salt and Pepper
ar: ملح وفلفل

source: Wash and cut salad and herbs
ar: اغسل واقطع السلطة والأعشاب

source: Dice the salmon
ar: قطع السلمون إلى مكعبات صغيرة

source: Process mustard, vinegar and olive oil into a dressing
ar: قم بمعالجة الخردل والخل وزيت الزيتون إلى صلصة

source: Prepare the salad
ar: قم بتحضير السلطة

source: Add salmon cubes and dressing
ar: أضف مكعبات السلمون والصلصة

# Gelatin_Sheets
source: 4 Sheets of Gelatin
ar: 4 ورقات جيلاتين

# Orange_Juice
source: 150ml Orange Juice
ar: 150 مل عصير البرتقال

# Sugar
source: 80g Sugar
ar: 80 غرام سكر

# Yoghurt
source: 300g Yoghurt
ar: 300 غرام زبادي

# Cream
source: 200g Cream
ar: 200 غرام كريمة

source: Orange Peel
ar: قشر البرتقال

# Dissolve_Gelatin
source: Dissolve gelatin in pot
ar: ذوب الجيلاتين في القدر

source: Add orange juice and sugar
ar: أضف عصير البرتقال والسكر

source: Take pot off the stove
ar: اخرج القدر من على النار

# Add_Yoghurt
source: Add 2 tablespoons of yoghurt
ar: أضف ملعقتين كبيرتين من الزبادي

source: Stir gelatin under remaining yoghurt
ar: حرك الجيلاتين تحت الزبادي المتبقي

# Cool_in_Refrigerator
source: Cool everything down in the refrigerator
ar: اترك كل شيء في الثلاجة ليبرد

# Whip_Cream
source: Whip the cream
ar: اخفق الكريمة

# Lift_Cream_Under_Orange_Mass
source: Lift it under die orange mass
ar: رفعه تحت الكتلة البرتقالية

# Cool_Down_Again
source: Cool down again for at least 4 hours
ar: اتركه يبرد مرة أخرى لمدة لا تقل عن 4 ساعات

source: Serve with orange peel
ar: قدم مع قشر البرتقال

# Flour
source: 1 1/2 Cups all-purpose Flour
ar: 1 1/2 كوب طحين متعدد الاستخدامات

# Baking_Powder
source: 3 1/2 Teaspoons Baking Powder
ar: 3 1/2 ملعقة صغيرة بيكنج بودر

# White_Sugar
source: 1 Tablespoon White Sugar
ar: ملعقة كبيرة سكر أبيض

# Milk
source: 1 1/4 cups Milk
ar: 1 1/4 كوب حليب

# Egg
source: 1 Egg
ar: بيضة واحدة

# Mix_Ingredients
source: In a large bowl, sift together the flour, baking powder, salt and sugar.
ar: في وعاء كبير، اخلط الطحين، بيكنج بودر، الملح والسكر معًا.

# Make_Well_and_Mix
source: Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.
ar: اصنع حفرة في الوسط واسكب فيها الحليب والبيض والزبدة المذابة. اخلط حتى يصبح الخليط ناعمًا.

# Heat_Griddle
source: Heat a lightly oiled griddle or frying pan over medium high heat.
ar: سخن مقلاة خفيفة مدهونة بزيت خفيف أو مقلاة على نار متوسطة.

# Pour_Batter
source: Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.
ar: اسكب الخليط على المقلاة، باستخدام ما يقرب من 1/4 كوب لكل فطيرة. قم بتحميرهم من الجانبين وقدمهم ساخنين.

# Chicken_Breasts
source: 4 Chicken Breasts
ar: 4 صدور دجاج

# Onion
source: 1 Onion
ar: بصلة واحدة

# Garlic
source: 2 Cloves of Garlic
ar: 2 فصوص ثوم

# Ginger
source: 1 Piece of Ginger
ar: قطعة من الزنجبيل

# Almonds
source: 4 Tablespoons Almonds
ar: 4 ملاعق كبيرة لوز

# Cayenne_Pepper
source: 1 Teaspoon Cayenne Pepper
ar: ملعقة صغيرة فلفل كايين

# Coconut_Milk
source: 500ml Coconut Milk
ar: 500 مل حليب جوز الهند

# Slice_and_Fry_Chicken
source: Slice and fry the chicken breast
ar: قطع واقلي صدور الدجاج

# Process_Onion_Garlic_Ginger
source: Process onion, garlic and ginger into paste and saute everything
ar: اخلط البصل والثوم والزنجبيل في الخلاط وقليها معًا

# Add_Spices
source: Add spices and stir fry
ar: أضف التوابل وقلب

# Cook_with_Water
source: Add chicken breast + 250ml of water and cook everything for 10 minutes
ar: أضف صدور الدجاج + 250 مل من الماء واترك كل شيء لمدة 10 دقائق

source: Add coconut milk
ar: أضف حليب جوز الهند

source: Serve with rice
ar: قدم مع الأرز

# Melted_Butter
source: 1 Teaspoon melted Butter
ar: 1 ملعقة صغيرة زبدة مذابة

# Dark_Chocolate
source: 2 Ounces 70% dark Chocolate, broken into pieces
ar: 2 أونصة (70٪) شوكولاتة داكنة، مكسرة إلى قطع

# Flour_for_Souffles
source: 1 Tablespoon all-purpose Flour
ar: 1 ملعقة كبيرة طحين متعدد الاستخدامات

# Cold_Milk
source: 4 1/3 tablespoons cold Milk
ar: 4 1/3 ملعقة كبيرة من الحليب البارد

# Salt_and_Pepper_for_Souffles
source: 1 Pinch Salt
ar: رشة ملح

# Cayenne_Pepper_for_Souffles
source: 1 Pinch Cayenne Pepper
ar: رشة فلفل كايين

# Egg_Yolk
source: 1 Large Egg Yolk
ar: صفار بيضة كبيرة

# Egg_Whites
source: 2 Large Egg Whites
ar: بياض بيضتين كبيرتين

# Cream_of_Tartar
source: 1 Pinch Cream of Tartar
ar: رشة صغيرة من مسحوق الكريمة التارتار

# Preheat_Oven
source: Preheat oven to 190°C. Line a rimmed baking sheet with parchment paper.
ar: سخن الفرن إلى 190 درجة مئوية. افرش صينية خبز بحواف بورقة زبدة.

# Prepare_Ramekins
source: Brush bottom and sides of 2 ramekins lightly with 1 teaspoon melted butter; cover bottom and sides right up to the rim.
ar: ادهن قاع وجوانب 2 أكواب بالزبدة المذابة بخفة ؛ اغط القاع والجوانب مباشرة حتى الحافة.

# Coat_Ramekins
source: Add 1 tablespoon white sugar to ramekins. Rotate ramekins until sugar coats all surfaces.
ar: أضف ملعقة كبيرة من السكر الأبيض إلى الأكواب. دورها حتى يغطي السكر جميع الأسطح.

# Melt_Chocolate
source: Place chocolate pieces in a metal mixing bowl.
ar: ضع قطع الشوكولاتة في وعاء معدني. ضع الوعاء فوق مقلاة بها حوالي 3 أكواب من الماء الساخن على نار خفيفة.

# Prepare_Chocolate_Mixture
source: Melt 1 tablespoon butter in a skillet over medium heat. Sprinkle in flour. Whisk until flour is incorporated into butter and mixture thickens.
ar: اذيب ملعقة كبيرة من الزبدة في مقلاة على نار متوسطة. رش الدقيق. اخلط حتى يتم تضمين الدقيق في الزبدة ويتم تكثيف المزيج.

# Whisk_In_Milk
source: Whisk in cold milk until mixture becomes smooth and thickens. Transfer mixture to bowl with melted chocolate.
ar: اخلط الحليب البارد حتى يصبح المزيج ناعمًا ويتكثف. انقل الخليط إلى الوعاء مع الشوكولاتة المذابة.

# Add_Seasoning_to_Chocolate
source: Add salt and cayenne pepper. Mix together thoroughly. Add egg yolk and mix to combine.
ar: أضف الملح والفلفل الكايين. اخلطها جيدًا. أضف صفار البيض وامزجه جيدًا.

# Place_bowl_over_a_pan_cups
source: Place bowl over a pan of about 3 cups hot water over low heat
ar: ضع الوعاء فوق مقلاة بها حوالي 3 أكواب من الماء الساخن على نار هادئة

# Leave_bowl_above_the_hot_water
source: Leave bowl above the hot (not simmering) water to keep chocolate warm while you whip the egg whites.
ar: اترك الوعاء فوق الماء الساخن (غير الغليان) للحفاظ على الشوكولاتة دافئة بينما تقوم بخفق بياض البيض.

# Place_egg_whites_in_a_mixing_bowl
source: Place 2 egg whites in a mixing bowl; add cream of tartar. Whisk until mixture begins to thicken and a drizzle from the whisk stays on the surface about 1 second before disappearing into the mix.
ar: ضع بياض البيض في وعاء خلط. أضف مسحوق الكريمة التارتار. اخفق حتى يبدأ المزيج في التكثيف ويظل القطر من الخلاط على السطح لمدة تقريبية ثانية واحدة قبل أن يختفي في المزيج.

# Add_sugar_whisk
source: Add 1/3 of sugar and whisk in. Whisk in a bit more sugar about 15 seconds.
ar: أضف 1/3 من السكر واخفقه. اخفق في كمية أكبر من السكر لمدة حوالي 15 ثانية.

# Whisk_in_the_rest
source: whisk in the rest of the sugar. Continue whisking until mixture is about as thick as shaving cream and holds soft peaks, 3 to 5 minutes.
ar: اخفق في بقية السكر. واستمر في الخفق حتى يصبح المزيج تقريبًا مثل الكريمة ويحتفظ بذروة ناعمة لمدة 3 إلى 5 دقائق.

# Transfer_a_little_less
source: Transfer a little less than half of egg whites to chocolate.
ar: نقل أقل من نصف بياض البيض إلى الشوكولاتة.

# Mix_until_egg_whites
source: Mix until egg whites are thoroughly incorporated into the chocolate.
ar: امزج حتى يتم دمج بياض البيض تمامًا في الشوكولاتة.

# Add_the_rest_of_the_egg
source: Add the rest of the egg whites; gently fold into the chocolate with a spatula, lifting from the bottom and folding over.
ar: أضف بقية بياض البيض؛ اطوِ بلطف في الشوكولاتة بواسطة ملعقة، ارفع من القاع واطوِ على الأعلى.

# Stop_mixing_after_the_egg_white_disappears
source: Stop mixing after the egg white disappears. Divide mixture between 2 prepared ramekins. Place ramekins on prepared baking sheet.
ar: توقف عن الخلط بعد أن يختفي بياض البيض. قسّم الخليط بين 2 أكواب معدة. ضع الأكواب على الصينية المخبوزة المُعَدَّة.

# Bake_in_preheated_oven_until_scuffles
source: Bake in preheated oven until scuffles are puffed and have risen above the top of the rims, 12 to 15 minutes.
ar: اخبز في الفرن المحمى مُسبقًا حتى تتورم الأطباق وترتفع فوق أعلى الحواف، لمدة 12 إلى 15 دقيقة.

source: White and Green Asparagus
ar: الهليون الأبيض والأخضر

# Pine_Nuts
source: 30g Pine Nuts
ar: 30 جرام من جوز الصنوبر

# Cherry_Tomatoes
source: 300g Cherry Tomatoes
ar: 300 جرام من الطماطم الكرزية

source: Salad
ar: سلطة

source: Salt, Pepper and Olive Oil
ar: ملح، فلفل، وزيت الزيتون

source: Wash, peel and cut the asparagus
ar: اغسل، قشِّر، وقطع الهليون

source: Cook in salted water
ar: اطهيه في ماء مملح

source: Salt and pepper the asparagus
ar: رش الملح والفلفل على الهليون

source: Roast the pine nuts
ar: احمص جوز الصنوبر

source: Halve the tomatoes
ar: قطّع الطماطم إلى نصفين

source: Mix with asparagus, salad and dressing
ar: امزج مع الهليون والسلطة والصلصة

source: Serve with Baguette
ar: قدم مع الباغيت

source: Language
ar: اللغة
